Tekla Open API Reference for Tekla Structures 2025
RebarPropertyModifier.SpacingOverride Property
 Gets or sets the spacing override.
 Namespace: Tekla.Structures.Model
 Assembly: Tekla.Structures.Model (in Tekla.Structures.Model.dll) Version: 2025.0.0-alpha00048669+a99462f17964bc42624ada6e8d316db2d795d226
Syntax
public RebarSpacing SpacingOverride { get; set; }
Public Property SpacingOverride As RebarSpacing
	Get
	Set
Property Value
Type: RebarSpacing
See Also
Reference
RebarPropertyModifier Class
Tekla.Structures.Model Namespace